//
//  Model.swift
//  tableView
//
//  Created by Hudihka on 09/06/2019.
//  Copyright © 2019 konstantinRAZRAB. All rights reserved.
//

import Foundation

class ArrayName: NSObject{
    static let nameMan =  ["Александр", "Максим", "Иван",
                           "Артем", "Никита", "Дмитрий",
                           "Егор", "Даниил", "Михаил",
                           "Андрей", "Алексей", "Илья",
                           "Илья", "Владислав", "Тимофей",
                           "Гайфутдинчик", "Стасян", "Педя",
                           "Матвей", "Николай", "Павел",
                           "Арсений", "Денис", "Степан",
                           "Федор", "Данила", "Антон",
                           "Егор1", "Даниил2", "Михаил3",
                           "Андрей1", "Алексей33", "Илья33",
                           "Илья323", "Владислав22",
                           "Борис", "Илья", "Колян",
                           "Олег", "Ухан",
                           "Хома", "Царь", "Чарли"];
    
    static let nameFemale = ["Александрa", "Саша", "Катька",
                             "Катюша", "Жанна", "Тетя",
                             "Лиза", "Дашка", "Даша",
                             "Вика", "Валя", "Ира",
                             "Инна", "Ирина", "Света",
                             "Светка", "Стася", "Алина",
                             "Альбина", "Оксана", "Олеся",
                             "Алеся", "Настюха", "Анастасия",
                             "Фатима", "Лоя", "Хлоя",
                             "Лолита", "Люба", "Зина",
                             "Галя", "Тамара", "Тома",
                             "Милана", "Люда", "Баба",
                             "Элля", "Юля", "Яна"];
}


struct Human {
    var name: String
    var gender: Bool

    init(name: String, gender: Bool) {
        self.name = name
        self.gender = gender
    }
}
